#### IFCOpeningData Members

---

|  |
| --- |
| IFCOpeningData Class   Methods   Properties   See Also |

The  IFCOpeningData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  IFCOpeningData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetExtrusionData | Gets extrusion data. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetOpeningSolids | Gets opening solids. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsRecess | Trus if it is a recess, false if it is an opening. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | OpeningElementId | The opening element id. |

# See Also

IFCOpeningData Class

Autodesk.Revit.DB.IFC Namespace